//
//  BenefitViewModel.swift
//  Kidzzle
//
//  Created by aynnipa on 19/3/2568 BE.
//

import Foundation
import UIKit

class BenefitViewModel: ObservableObject {
    
    struct ServiceURLs {
        let nhsoCheck = "https://eservices.nhso.go.th/eServices/mobile/login.xhtml"
        let welfareSystem = "https://welfare.dcy.go.th/"
        let subsidyCheck = "https://csgcheck.dcy.go.th/public/eq/popSubsidy.do?ms=1599417061751"
    }
    
    var urls: ServiceURLs {
        return ServiceURLs()
    }
    
    // เปิด URL ภายนอก
    func openURL(_ urlString: String) {
        guard let url = URL(string: urlString),
              UIApplication.shared.canOpenURL(url) else {
            return
        }
        UIApplication.shared.open(url)
    }
    
    @Published var benefitNHSO: [String] = [
        "เสริมสร้างสุขภาพ และป้องกันโรค การตรวจคัดกรองหาภาวะเสี่ยง",
        "ตรวจ ฝากครรภ์ และคลอดบุตร ไม่จำกัดจำนวนครั้ง",
        "การดูแลเด็กแรกเกิด",
        "การบำบัดและการบริการทางการแพทย์",
        "การสร้างภูมิคุ้มกัน เช่น การฉีดวัคซีน การให้ยาบำรุง การเคลือบฟลูออไรด์",
        "ค่าเวชภัณฑ์ อวัยวะเทียม และอุปกรณ์ทางการแพทย์ ตามกรอบบัญชียาหลัก และยาที่มีราคาสูง",
        "ค่าอาหารและค่าห้องสามัญ ระหว่างพักรักษาตัวในหน่วยบริการ",
        "บริการรถพยาบาล หรือบริการพาหนะรับ - ส่งผู้ป่วย และผู้ทุพพลภาพ",
        "การฟื้นฟูสมรรถภาพร่างกายและจิตใจ ของผู้พิการ ผู้สูงอายุ และผู้ที่จำเป็นต้องได้รับการฟื้นฟู",
        "บริการแพทย์แผนไทยและการแพทย์ทางเลือก",
        "การบำบัดรักษาและฟื้นฟูผู้ติดยาและสารเสพติด",
        "โรคเดียวกันที่ต้องใช้เวลารักษาตัวในโรงพยาบาลเกิน 180 วัน ใน 1 ปี"
    ]
    
    @Published var contactNHSO: [String] = [
        "แอปพลิเคชัน สปสช. (App Store และ Google Play Store)",
        "LINE Official : @nhso (มี @)",
        "โรงพยาบาลส่งเสริมสุขภาพตำบล (รพ.สต.) / โรงพยาบาลรัฐใกล้บ้าน (วันเวลาราชการ)",
    ]
    
    @Published var documentNHSO: [DocumentSection] = [
        DocumentSection(
            title: "1. สำหรับประชาชนพักตรงตามที่อยู่หน้าบัตรประจำตัวประชาชน/สูติบัตร",
            details: [
                "เอกสารที่ใช้ : บัตรประจำตัวประชาชน / สูติบัตร (กรณีเด็กอายุต่ำกว่า 7 ปี)"
            ]
        ),
        DocumentSection(
            title: "2. สำหรับประชาชนพักไม่ตรงตามที่อยู่หน้าบัตรประจำตัวประชาชน/สูติบัตร",
            details: [
                "ทะเบียนบ้านเจ้าบ้านและหนังสือรับรองของเจ้าบ้าน",
                "หนังสือรับรองผู้นำชุมชนและบัตรประจำตัวผู้นำชุมชน",
                "หนังสือรับรองผู้ว่าจ้างและบัตรประจำตัวประชาชนของผู้ว่าจ้าง",
                "ใบเสร็จค่าสาธารณูปโภค (หากเป็นชื่อผู้ขอลงทะเบียนใช้รับรองได้)",
                "สัญญาเช่าที่พัก (สัญญาเช่าเป็นชื่อผู้ขอลงทะเบียน/ชื่อญาติ สามารถใช้รับรองได้)"
            ]
        ),
        DocumentSection(
            title: "3. กรณีลงทะเบียนผ่านแอปพลิเคชัน สปสช. / ไลน์ สปสช. @nhso",
            details: [
                "เอกสารใช้รูปแบบไฟล์"
            ]
        )
    ]
    
    @Published var protectMSDHS: [DocumentSection] = [
        DocumentSection(
            title: "กองทุนคุ้มครองเด็ก",
            details: [
                "เป็นทุนใช้จ่ายในการสงเคราะห์คุ้มครองสวัสดิภาพและส่งเสริมความประพฤติเด็ก รวมทั้งครอบครัวและครอบครัวอุปถัมภ์ของเด็ก หมายความว่า บุคคลซึ่งมีอายุต่ำกว่า  18  ปีบริบูรณ์ แต่ไม่รวมถึงผู้ที่บรรลุนิติภาวะด้วยการสมรส",
            ]
        ),
        DocumentSection(
            title: "ผู้ที่มีสิทธิ์",
            details: [
                "เด็กที่พึงได้รับการสงเคราะห์ (มาตรา 32) เช่น เด็กเร่ร่อนหรือเด็กกำพร้า เด็กพิการ เด็กที่อยู่ในสภาพยากลำบาก เด็กที่ถูกทอดทิ้งหรือพลัดหลง ณ ที่ใดที่หนึ่ง",
                "เด็กที่พึงได้รับการคุ้มครองสวัสดิภาพ (มาตรา 40) เช่น เด็กที่ถูกทารุณกรรม",
                "เด็กที่เสี่ยงต่อการกระทำผิด",
                "นักเรียน นักศึกษาที่พึงได้รับการส่งเสริมความประพฤติที่เหมาะสม"
            ]
        ),
        DocumentSection(
            title: "ติดต่อกองทุนคุ้มครองเด็ก",
            details: [
                "เลขที่ 618/1 ถ.นิคมมักกะสัน เขตราชเทวี กรุงเทพมหานคร 10400",
                "โทรศัพท์ 0 2651 6634, 0 2651 6959",
                "โทรสาร 0 2651 6881",            ]
        )
    ]
    
    @Published var allowanceMSDHS: [DocumentSection] = [
        DocumentSection(
            title: "คุณสมบัติเด็กแรกเกิดที่มีสิทธิ",
            details: [
                "มีสัญชาติไทย (พ่อแม่มีสัญชาติไทย หรือพ่อหรือแม่มีสัญชาติไทย)",
                "เกิดตั้งแต่วันที่ 1 ตุลาคม 2558 เป็นต้นไป จนมีอายุครบ 6 ปี",
                "อาศัยอยู่กับผู้ปกครองที่อยู่ในครัวเรือนที่มีรายได้น้อย",
                "ไม่อยู่ในสถานสงเคราะห์ของหน่วยงานของรัฐ หรือเอกชน"
            ]
        ),
        DocumentSection(
            title: "คุณสมบัติผู้ปกครองที่มีสิทธิลงทะเบียน",
            details: [
                "มีสัญชาติไทย",
                "เป็นบุคคลที่รับเด็กแรกเกิดไว้ในความอุปการะ",
                "เด็กแรกเกิดต้องอาศัยรวมอยู่ด้วย",
                "อยู่ในครัวเรือนที่มีรายได้น้อย คือ สมาชิกครัวเรือนมีรายได้เฉลี่ยไม่เกิน 100,000 บาท ต่อคน ต่อปี"
            ]
        ),
        DocumentSection(
            title: "หมายเหตุ",
            details: [
                "มารดาที่อยู่ระหว่างการตั้งครรภ์ยังไม่ต้องมายื่นคำร้องขอลงทะเบียนขอรับสิทธิเงินอุดหนุนเพื่อการเลี้ยงดูเด็กแรกเกิด"
            ]
        ),
        DocumentSection(
            title: "สถานที่รับลงทะเบียน",
            details: [
                "กรุงเทพมหานคร: ลงทะเบียนที่สำนักงานเขต",
                "ส่วนภูมิภาค: ลงทะเบียนที่องค์การบริหารส่วนตำบล หรือเทศบาล"
            ]
        )
    ]
    
    @Published var documentMSDHS: [DocumentSection] = [
          DocumentSection(
              title: "เอกสารประกอบการลงทะเบียน",
              details: [
                  "แบบคำร้องขอลงทะเบียน (ดร.01)",
                  "แบบรับรองสถานะของครัวเรือน (ดร.02)",
                  "บัตรประจำตัวประชาชนของผู้ปกครอง",
                  "สูติบัตรเด็กแรกเกิด"
              ]
          ),
          DocumentSection(
              title: "เอกสารทางการเงิน",
              details: [
                  "สมุดบัญชีเงินฝากของผู้ปกครอง (บัญชีออมทรัพย์ธนาคารกรุงไทย บัญชีเงินฝากเผื่อเรียกธนาคารออมสิน หรือบัญชีเงินฝากออมทรัพย์ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร (ธกส.) อย่างใดอย่างหนึ่งเท่านั้น)"
              ]
          ),
          DocumentSection(
              title: "เอกสารสุขภาพ",
              details: [
                  "สมุดบันทึกสุขภาพแม่และเด็ก เฉพาะหน้าที่ 1 ที่มีชื่อของหญิงตั้งครรภ์ (ในกรณีที่สมุดสูญหายให้ใช้เฉพาะสำเนาหน้าที่ 1 พร้อมให้เจ้าหน้าที่สาธารณสุขบันทึกข้อมูลและรับรองสำเนา)"
              ]
          ),
          DocumentSection(
              title: "กรณีพนักงานหรือเจ้าหน้าที่รัฐ",
              details: [
                  "ใบรับรองเงินเดือน หรือหนังสือรับรองรายได้ของทุกคนที่มีรายได้ประจำ (สลิปเงินเดือน หรือเอกสารหลักฐานที่นายจ้างลงนาม)",
                  "สำเนาเอกสาร หรือบัตรข้าราชการ เจ้าหน้าที่ของรัฐ บัตรแสดงสถานะหรือตำแหน่ง หรือเอกสารอื่นใดที่แสดงตนของผู้รับรองคนที่ 1 และผู้รับรองคนที่ 2"
              ]
          )
      ]
}
